"""
shape：以中心点为坐标系，计算各个方块相对中心的偏移量，得到形状。
"""
shapes_dict = {
    "O": {"shape": [(-1, -1), (0, -1), (-1, 0), (0, 0)], "color": "blue"},
    "S": {"shape": [(-1, 0), (0, 0), (0, -1), (1, -1)], "color": "red"},
    "T": {"shape": [(-1, 0), (0, 0), (0, -1), (1, 0)], "color": "yellow"},
    "I": {"shape": [(0, 1), (0, 0), (0, -1), (0, -2)], "color": "green"},
    "L": {"shape": [(-1, 0), (0, 0), (-1, -1), (-1, -2)], "color": "purple"},
    "J": {"shape": [(-1, 0), (0, 0), (0, -1), (0, -2)], "color": "orange"},
    "Z": {"shape": [(-1, -1), (0, -1), (0, 0), (1, 0)], "color": "Cyan"},
}
